// Домашнее задание
// Необязательная к выполнению задача (не будет влиять на итоговую оценку ДЗ)
// Дополнительная задача 2 (задача со звёздочкой): 
// Напишите программу, которая выводит монотонную последовательность из N элементов в виде равностороннего треугольника с помощью рекурсии
// Пример:
// N = 5 -> https://ibb.co/9nZgLtY

Console.Clear();
Console.WriteLine("");


Console.Write(" -> ");