// Домашнее задание
// Необязательная к выполнению задача (не будет влиять на итоговую оценку ДЗ)
// Дополнительная задача (задача со звёздочкой): 
// Напишите программу вычисления функции Аккермана с помощью рекурсии. Даны два неотрицательных числа m и n.
// Например:
// m = 3, n = 2 -> A(m,n) = 29

Console.Clear();
Console.WriteLine("");


Console.Write(" -> ");