// Домашнее задание
// 66. Задайте значения M и N. Напишите программу, которая найдёт сумму натуральных элементов в промежутке от M до N с помощью рекурсии.
// Например:
// M = 1; N = 15 -> 120
// M = 4; N = 8 -> 30

Console.Clear();
Console.WriteLine("");


Console.Write(" -> ");